### 1 pandas数据结构之Series
### 1.1 创建Series

In [1]:
# 导入pandas和numpy
#!pip install  numpy
#!pip install  pandas
import pandas as pd
import numpy as np

### 1.1.1 从ndarray创建Series

In [2]:
s = pd.Series(np.random.randint(0,5,5)) # Series对象
print("s.index: ",s.index)
print("s.values: ",s.values)
s

s.index:  RangeIndex(start=0, stop=5, step=1)
s.values:  [0 4 0 4 3]

0    0
1    4
2    0
3    4
4    3
dtype: int32

In [5]:
s = pd.Series(np.random.randn(6), index=['a', 'b', 'c', 'd', 'e', 'a'])
s

a    0.075487
b   -0.878752
c    1.046483
d    0.237349
e    1.399335
a   -2.681193
dtype: float64

In [6]:
s.index

Index(['a', 'b', 'c', 'd', 'e', 'a'], dtype='object')

In [4]:
# 不传入索引
t = pd.Series(np.random.randn(5))
t

0    1.441901
1    0.687205
2    1.701562
3    0.811923
4    0.417101
dtype: float64

In [5]:
t.index

RangeIndex(start=0, stop=5, step=1)

### 1.1.2 从字典或列表创建Series

In [23]:
d = {'a' : 1, 'c' : 3, 'e' :5}

In [15]:
d["c"]  # 字典通过key来获取value

3

In [49]:
'e' in d

True

In [16]:
d.get("c")

3

In [24]:
# 不传入索引
s = pd.Series(d)
s

a    1
c    3
e    5
dtype: int64

In [18]:
s["c"]

3

In [19]:
s.get("c")

3

In [25]:
# 传入索引，以索引为准
d = {'a' : 1, 'c' : 3, 'e' :5}  # length=3
index=['a','b','c','d','e'] # length=5
s = pd.Series(d,index=index)
s

a    1.0
b    NaN
c    3.0
d    NaN
e    5.0
dtype: float64

In [26]:
# 传入索引，以索引为准
d = {'a' : 1, 'c' : 3, 'e' :5, 'f':8}  # 存在索引之外的键值对 f
index=['a','b','c','d','e'] 
s = pd.Series(d,index=index)
s

a    1.0
b    NaN
c    3.0
d    NaN
e    5.0
dtype: float64

In [29]:
# 列表
s = pd.Series([x for x in range(1,5)],index=list('abcd'))
s

a    1
b    2
c    3
d    4
dtype: int64

In [13]:
list('abcdef')

['a', 'b', 'c', 'd', 'e', 'f']

In [10]:
t = pd.Series([x for x in range(1,5)])
t

0    1
1    2
2    3
3    4
dtype: int64

### 1.1.3 从标量创建

In [11]:
pd.Series(999)

0    999
dtype: int64

In [12]:
pd.Series(999,['a','b','c','d'])

a    999
b    999
c    999
d    999
dtype: int64

### 1.2 对Series的操作
### 1.2.1 Series和ndarray相似的操作

In [29]:
s = pd.Series(np.random.randn(3), index=['a', 'b', 'c'])
s

a    0.215517
b   -0.520416
c   -0.328189
dtype: float64

In [30]:
s[0]  # 使用位置索引

0.21551702320493185

In [16]:
s['b'] # 使用索引值

-0.4384551579481776

In [33]:
t = pd.Series([1,2,3,4],[11,12,13,14])
t[11]  # 如果index是数值，[]里是index值，而不是位置

1

In [37]:
t = pd.Series([1,2,3,4],['a', 'b', 'c', 'd'])
t[0]

1

In [38]:
s['c'] = 999
s

a      1
b      2
c    999
d      4
dtype: int64

In [46]:
s['e'] = 123  # 直接在原Series上添加一个新的元素
s2 = s.append(pd.Series("321",index=["f"])) # 添加一个新的元素，得到一个新的数组
s2

a      1
b      2
c    999
d      4
e    123
f    321
dtype: object

In [47]:
'a' in s  # 是否存在索引(key)

True

In [43]:
'a' in s.index

True

In [42]:
# 判断值是否存在
999 in s.values

True

In [19]:
'f' in s

False

In [50]:
#固定错误 将错误打印出来
#s['f']
#KeyError: 'f'

In [21]:
s.get('b')

-0.4384551579481776

In [51]:
s.get('f')

In [52]:
s.get('f','f不在索引列表中')

'f不在索引列表中'

In [55]:
s = pd.Series(np.random.randn(3), index=['a', 'b', 'c'])
s

a    0.005738
b    0.252318
c   -1.209682
dtype: float64

In [59]:
s[:2]  # [起点:终点] 不包含终点

a    0.005738
b    0.252318
dtype: float64

In [58]:
s[:'c']  # 按值切片包含终点

a    0.005738
b    0.252318
c   -1.209682
dtype: float64

In [62]:
s[ ['a','c'] ]

a    0.005738
c   -1.209682
dtype: float64

In [63]:
s[1:3]

b    0.252318
c   -1.209682
dtype: float64

In [64]:
# 数字索引在任何时候都有效
s[['a','c']]
s[[0,2]]

a    0.005738
c   -1.209682
dtype: float64

In [65]:
s[ [True,False,True] ]  # 布尔索引

a    0.005738
c   -1.209682
dtype: float64

In [67]:
print(s.median())
s > s.median() # 返回一个Series

0.0057381278750865865

a    False
b     True
c    False
dtype: bool

In [68]:
s[s>s.median()]  # 条件索引

b    0.252318
dtype: float64

### 1.2.2 向量化运算

In [52]:
s = pd.Series([1,2,3,4])  # 值为一维向量
s

0    1
1    2
2    3
3    4
dtype: int64

In [53]:
s + s

0    2
1    4
2    6
3    8
dtype: int64

In [70]:
s1 = pd.Series([1,2,3,4],index=[0,1,2,3])
s2 = pd.Series([1,2,3,4],index=[5,6,7,8])
s1+s2

0   NaN
1   NaN
2   NaN
3   NaN
5   NaN
6   NaN
7   NaN
8   NaN
dtype: float64

In [71]:
s * 3

a    0.017214
b    0.756955
c   -3.629047
dtype: float64

In [73]:
np.sqrt(np.abs(s))

a    0.075750
b    0.502313
c    1.099856
dtype: float64

In [74]:
np.square(s)

a    0.000033
b    0.063665
c    1.463332
dtype: float64

In [57]:
s > 2

0    False
1    False
2     True
3     True
dtype: bool

In [36]:
s[s>s.median()]

2    3
3    4
dtype: int64

### 1.2.3 类似字典的操作

In [58]:
s = pd.Series([x for x in range(1,10)],list('abcdefghi'))
s

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
i    9
dtype: int64

In [59]:
# 列表解析
[x for x in range(1,10)]

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [60]:
# list函数把字符串变成列表
list('abcdefjhi')

['a', 'b', 'c', 'd', 'e', 'f', 'j', 'h', 'i']

In [61]:
s['a']

1

In [62]:
s['a'] = 999
s

a    999
b      2
c      3
d      4
e      5
f      6
g      7
h      8
i      9
dtype: int64

In [63]:
'i' in s

True

In [64]:
'j' in s

False

In [44]:
#固定错误
s['j']
KeyError: 'j'

KeyError: 'j'

In [45]:
s.get('j')

In [46]:
s.get('j','索引中不存在j')

'索引中不存在j'

### 1.2.4 时间序列操作

In [77]:
# 生成从2018年9月1日开始，10天的时间序列索引，频率为10分钟
rng = pd.date_range('2023-03-20', periods=1440, freq='H') #periods=count or length
rng

DatetimeIndex(['2023-03-20 00:00:00', '2023-03-20 01:00:00',
               '2023-03-20 02:00:00', '2023-03-20 03:00:00',
               '2023-03-20 04:00:00', '2023-03-20 05:00:00',
               '2023-03-20 06:00:00', '2023-03-20 07:00:00',
               '2023-03-20 08:00:00', '2023-03-20 09:00:00',
               ...
               '2023-05-18 14:00:00', '2023-05-18 15:00:00',
               '2023-05-18 16:00:00', '2023-05-18 17:00:00',
               '2023-05-18 18:00:00', '2023-05-18 19:00:00',
               '2023-05-18 20:00:00', '2023-05-18 21:00:00',
               '2023-05-18 22:00:00', '2023-05-18 23:00:00'],
              dtype='datetime64[ns]', length=1440, freq='H')

In [78]:
rng[:5]

DatetimeIndex(['2023-03-20 00:00:00', '2023-03-20 01:00:00',
               '2023-03-20 02:00:00', '2023-03-20 03:00:00',
               '2023-03-20 04:00:00'],
              dtype='datetime64[ns]', freq='H')

In [80]:
ts = pd.Series(np.random.randn(1440),index = rng)
ts.head()

2023-03-20 00:00:00    2.531951
2023-03-20 01:00:00    1.176797
2023-03-20 02:00:00    0.350173
2023-03-20 03:00:00   -0.688682
2023-03-20 04:00:00    0.061968
Freq: H, dtype: float64

In [50]:
ts.count()

1440

In [81]:
ts[:5]

2023-03-20 00:00:00    2.531951
2023-03-20 01:00:00    1.176797
2023-03-20 02:00:00    0.350173
2023-03-20 03:00:00   -0.688682
2023-03-20 04:00:00    0.061968
Freq: H, dtype: float64

In [82]:
ts[:10:2]

2023-03-20 00:00:00    2.531951
2023-03-20 02:00:00    0.350173
2023-03-20 04:00:00    0.061968
2023-03-20 06:00:00    1.248692
2023-03-20 08:00:00   -1.661236
Freq: 2H, dtype: float64

In [85]:
# 改变时间频率
converted = ts.asfreq('24H')
converted.head()

2023-03-20    2.531951
2023-03-21    1.561833
2023-03-22    0.511060
2023-03-23   -0.601644
2023-03-24   -3.271553
Freq: 24H, dtype: float64

In [72]:
ss = ts.resample('D')
ss

DatetimeIndexResampler [freq=<Day>, axis=0, closed=left, label=left, convention=start, base=0]

In [86]:
# 按天粒度汇总
resampled = ts.resample('D').mean()
resampled

2023-03-20    0.084188
2023-03-21    0.056744
2023-03-22    0.564209
2023-03-23   -0.543093
2023-03-24    0.251171
2023-03-25    0.084437
2023-03-26   -0.040482
2023-03-27    0.355333
2023-03-28   -0.319253
2023-03-29   -0.324923
2023-03-30   -0.053227
2023-03-31    0.163008
2023-04-01   -0.322619
2023-04-02    0.170060
2023-04-03    0.025056
2023-04-04    0.004166
2023-04-05    0.077139
2023-04-06   -0.078510
2023-04-07    0.123707
2023-04-08    0.252068
2023-04-09    0.015163
2023-04-10   -0.022239
2023-04-11   -0.349885
2023-04-12   -0.143222
2023-04-13   -0.149051
2023-04-14    0.024444
2023-04-15   -0.084165
2023-04-16   -0.010910
2023-04-17    0.380838
2023-04-18   -0.437032
2023-04-19    0.114898
2023-04-20   -0.285413
2023-04-21    0.112597
2023-04-22   -0.481230
2023-04-23   -0.244489
2023-04-24   -0.033597
2023-04-25   -0.117557
2023-04-26    0.009165
2023-04-27    0.064567
2023-04-28   -0.206596
2023-04-29   -0.180056
2023-04-30   -0.329474
2023-05-01   -0.139098
2023-05-02   -0.098630
2023-05-03   -0.274003
2023-05-04    0.089157
2023-05-05    0.262931
2023-05-06    0.164739
2023-05-07   -0.116698
2023-05-08   -0.107850
2023-05-09   -0.128975
2023-05-10    0.147412
2023-05-11    0.075880
2023-05-12   -0.010047
2023-05-13    0.180337
2023-05-14   -0.287421
2023-05-15    0.248141
2023-05-16   -0.080697
2023-05-17    0.114324
2023-05-18    0.288206
Freq: D, dtype: float64

In [87]:
# 对时间序列数据进行索引
resampled[:5]

2023-03-20    0.084188
2023-03-21    0.056744
2023-03-22    0.564209
2023-03-23   -0.543093
2023-03-24    0.251171
Freq: D, dtype: float64

In [88]:
resampled[::2]

2023-03-20    0.084188
2023-03-22    0.564209
2023-03-24    0.251171
2023-03-26   -0.040482
2023-03-28   -0.319253
2023-03-30   -0.053227
2023-04-01   -0.322619
2023-04-03    0.025056
2023-04-05    0.077139
2023-04-07    0.123707
2023-04-09    0.015163
2023-04-11   -0.349885
2023-04-13   -0.149051
2023-04-15   -0.084165
2023-04-17    0.380838
2023-04-19    0.114898
2023-04-21    0.112597
2023-04-23   -0.244489
2023-04-25   -0.117557
2023-04-27    0.064567
2023-04-29   -0.180056
2023-05-01   -0.139098
2023-05-03   -0.274003
2023-05-05    0.262931
2023-05-07   -0.116698
2023-05-09   -0.128975
2023-05-11    0.075880
2023-05-13    0.180337
2023-05-15    0.248141
2023-05-17    0.114324
Freq: 2D, dtype: float64

In [90]:
# 时间字符串索引
ts['2023-03-21'][:10]

2023-03-21 00:00:00    1.561833
2023-03-21 01:00:00   -0.428663
2023-03-21 02:00:00    0.327300
2023-03-21 03:00:00    0.430497
2023-03-21 04:00:00   -0.941447
2023-03-21 05:00:00   -0.764732
2023-03-21 06:00:00    1.237541
2023-03-21 07:00:00   -0.141798
2023-03-21 08:00:00   -1.406128
2023-03-21 09:00:00    1.185498
Freq: H, dtype: float64

In [91]:
# datetime类型的索引
from datetime import datetime
ts[datetime(2023,3,20):][::60]

2023-03-20 00:00:00    2.531951
2023-03-22 12:00:00    0.742079
2023-03-25 00:00:00   -3.457259
2023-03-27 12:00:00   -1.602899
2023-03-30 00:00:00   -0.109753
2023-04-01 12:00:00   -0.128971
2023-04-04 00:00:00   -0.330808
2023-04-06 12:00:00   -0.712442
2023-04-09 00:00:00    1.929578
2023-04-11 12:00:00   -1.959302
2023-04-14 00:00:00    0.641448
2023-04-16 12:00:00   -0.282230
2023-04-19 00:00:00    0.511924
2023-04-21 12:00:00    0.113687
2023-04-24 00:00:00    0.099162
2023-04-26 12:00:00    1.314438
2023-04-29 00:00:00   -1.794422
2023-05-01 12:00:00   -0.811882
2023-05-04 00:00:00    0.302338
2023-05-06 12:00:00   -2.893111
2023-05-09 00:00:00    0.346289
2023-05-11 12:00:00   -1.816465
2023-05-14 00:00:00   -1.731566
2023-05-16 12:00:00    1.025570
Freq: 60H, dtype: float64

In [92]:
s  = pd.Series(['apple','banana','apple','apple','banana'])
s

0     apple
1    banana
2     apple
3     apple
4    banana
dtype: object

In [93]:
s.value_counts()

apple     3
banana    2
dtype: int64

In [96]:
df = pd.read_csv("student.csv")
s = df["性别"]
map_dict = {"男":1,"女":0}  # 值映射字典
s1 = s.map(map_dict)  # 生成一个新的series,不会修改原Series
s1

0    1
1    1
2    1
3    0
4    1
5    0
6    1
7    0
8    1
9    1
Name: 性别, dtype: int64

In [98]:
s.map("我是{}生".format)  # 高阶函数，里面传入的是函数本身，不要加括号

0    我是男生
1    我是男生
2    我是男生
3    我是女生
4    我是男生
5    我是女生
6    我是男生
7    我是女生
8    我是男生
9    我是男生
Name: 性别, dtype: object

In [99]:
s.map(lambda x:f"我是{x}生")

0    我是男生
1    我是男生
2    我是男生
3    我是女生
4    我是男生
5    我是女生
6    我是男生
7    我是女生
8    我是男生
9    我是男生
Name: 性别, dtype: object

In [103]:
s.apply(lambda x:f"我是{x}生")

0    我是男生
1    我是男生
2    我是男生
3    我是女生
4    我是男生
5    我是女生
6    我是男生
7    我是女生
8    我是男生
9    我是男生
Name: 性别, dtype: object

In [101]:
pd.Series([0,1,2]).map(lambda x:x**2)

0    0
1    1
2    4
dtype: int64

In [102]:
pd.Series([0,1,2]).apply(lambda x:x**2)

0    0
1    1
2    4
dtype: int64

In [106]:
pd.DataFrame(s)

  性别
0  男
1  男
2  男
3  女
4  男
5  女
6  男
7  女
8  男
9  男

### 2 pandas数据结构之DataFrame
### 2.1 DataFrame的创建
### 2.1.1 从Series or dicts创建

In [98]:
# 创建一个字典对象，字典的值为一个一维序列
# DataFrame = {列名1:Series1，列名2:Series2}
d = {'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
     'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [101]:
print(d["two"])
df["two"]

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

a    1.0
b    2.0
c    3.0
d    4.0
Name: two, dtype: float64

In [102]:
# 将字典转换成DataFrame,字典的键将会成为DataFrame的column's name
pd.DataFrame(d,index =['a','b','c'])

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0

In [103]:
# 指定索引名称，生成DataFrame
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [104]:
# 指定column's name 生成DataFrame
pd.DataFrame(d, index=['b', 'a'], columns=['one','two', 'three'])

   one  two three
b  2.0  2.0   NaN
a  1.0  1.0   NaN

### 2.1.2 从ndarrays或lists的字典创建

In [109]:
# list的长度需要一致,组成字典
# 注意：ValueError: All arrays must be of the same length
d = {'one':[1,2,3,4,5,6,7],
    'two':['a','b','c','d','e','f','g'],
    'three':[False,True,True,True,False,False,True]}
# arrays must all be same length

In [110]:
pd.DataFrame(d)

   one two  three
0    1   a  False
1    2   b   True
2    3   c   True
3    4   d   True
4    5   e  False
5    6   f  False
6    7   g   True

In [114]:
pd.DataFrame(d,columns=['one','three'])

   one  three
0    1  False
1    2   True
2    3   True
3    4   True
4    5  False
5    6  False
6    7   True

In [114]:
# 如果传入索引，则索引的长度必须和ndarray数组或list的长度一致
pd.DataFrame(d,columns=['one','three'],index = list('abcdefg'))

   one  three
a    1  False
b    2   True
c    3   True
d    4   True
e    5  False
f    6  False
g    7   True

### 2.1.3 从结构化或成对的array/list创建

In [115]:
# from ndarray
array = np.array([[1,2,3,4],[4,5,6,7]])
array

array([[1, 2, 3, 4],
       [4, 5, 6, 7]])

In [116]:
pd.DataFrame(array,columns=list('abcd'))

   a  b  c  d
0  1  2  3  4
1  4  5  6  7

In [117]:
array = np.arange(1,13).reshape(3,4)
array

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]])

In [118]:
pd.DataFrame(array,columns=list('abcd'))

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [120]:
a = [[[1,2],[3,4]],[[5,6],[7,8]]]  # 原生列表
pd.DataFrame(a)

        0       1
0  [1, 2]  [3, 4]
1  [5, 6]  [7, 8]

In [122]:
df = pd.DataFrame(a)
df[0][0]

[1, 2]

In [123]:
array = np.array(a)  # numpy 3darray
array.ndim

3

In [124]:
#固定错误
pd.DataFrame(np.array(a))
#ValueError: Must pass 2-d input

ValueError: Must pass 2-d input. shape=(2, 2, 2)

In [129]:
# from list
c = [[1,2,3,4],[4,5,6,7]]

In [130]:
pd.DataFrame(c,index=list('xy'),columns=list('abcd'))

   a  b  c  d
x  1  2  3  4
y  4  5  6  7

In [131]:
pd.DataFrame(c)

   0  1  2  3
0  1  2  3  4
1  4  5  6  7

### 2.1.3 从字典的列表创建

In [125]:
data = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [126]:
pd.DataFrame(data,columns=['a','b'],index=['first','second'])

        a   b
first   1   2
second  5  10

### 2.2 变量选择、添加和删除

In [1]:
import pandas as pd
df = pd.DataFrame({'one':[1,2,3,4,5,6],
                 'two':[2,3,4,5,6,7]})
df

   one  two
0    1    2
1    2    3
2    3    4
3    4    5
4    5    6
5    6    7

In [2]:
# 查看某列
df['one']  # 索引操作， 通过列名索引，取列

0    1
1    2
2    3
3    4
4    5
5    6
Name: one, dtype: int64

In [4]:
df[[False,False,True,True,False,False]]  # 通过bool数组索引，筛选是否选取行

   one  two
2    3    4
3    4    5

In [129]:
df['one'] > 3  # 对df或者s使用比较运算符会对其中每一个值应用比较运算，生成一个bool数列

0    False
1    False
2    False
3     True
4     True
5     True
Name: one, dtype: bool

In [130]:
# 选择满足一定条件的记录
df[df['one'] > 3]  # 一维布尔向量对应行索引

   one  two
3    4    5
4    5    6
5    6    7

In [5]:
df>2  # 得到一个bool矩阵

     one    two
0  False  False
1  False   True
2   True   True
3   True   True
4   True   True
5   True   True

In [9]:
df[df>2]

   one  two
0  NaN  NaN
1  NaN  3.0
2  3.0  4.0
3  4.0  5.0
4  5.0  6.0
5  6.0  7.0

In [6]:
# 基于已有列添加新列
df['three'] = df['one'] + df['two']  # 直接给新的列名 的列赋值，就可以增加一个列
df['four'] = df['one'] > 2
df

   one  two  three   four
0    1    2      3  False
1    2    3      5  False
2    3    4      7   True
3    4    5      9   True
4    5    6     11   True
5    6    7     13   True

In [7]:
# 添加一个新的列，并赋值一个标量，
#则会自动为整个列赋值为该标量值
df['five'] = 9999
df

   one  two  three   four  five
0    1    2      3  False  9999
1    2    3      5  False  9999
2    3    4      7   True  9999
3    4    5      9   True  9999
4    5    6     11   True  9999
5    6    7     13   True  9999

In [8]:
df['six'] = pd.Series(['b','c','d'],index = [1,2,3])   # 添加的列会和原df的索引自动对齐
df

   one  two  three   four  five  six
0    1    2      3  False  9999  NaN
1    2    3      5  False  9999    b
2    3    4      7   True  9999    c
3    4    5      9   True  9999    d
4    5    6     11   True  9999  NaN
5    6    7     13   True  9999  NaN

In [9]:
df.insert(2,'insert_col2',list('abcdef')) # 插入列
df

   one  two insert_col2  three   four  five  six
0    1    2           a      3  False  9999  NaN
1    2    3           b      5  False  9999    b
2    3    4           c      7   True  9999    c
3    4    5           d      9   True  9999    d
4    5    6           e     11   True  9999  NaN
5    6    7           f     13   True  9999  NaN

In [10]:
# 选择满足一定条件的记录
df[df['one'] > 3]

   one  two insert_col2  three  four  five  six
3    4    5           d      9  True  9999    d
4    5    6           e     11  True  9999  NaN
5    6    7           f     13  True  9999  NaN

In [11]:
df["three"] = df["one"] + df["two"]
three = df.pop('three')  # 弹出，删除这一列，并且返回这一列的series
three

0     3
1     5
2     7
3     9
4    11
5    13
Name: three, dtype: int64

In [12]:
df

   one  two insert_col2   four  five  six
0    1    2           a  False  9999  NaN
1    2    3           b  False  9999    b
2    3    4           c   True  9999    c
3    4    5           d   True  9999    d
4    5    6           e   True  9999  NaN
5    6    7           f   True  9999  NaN

In [13]:
del df['two']  # 字典的写法

In [15]:
df = df.append({"one":12},ignore_index=True) # 生成一个新的df
df

    one insert_col2  four    five  six
0   1.0           a   0.0  9999.0  NaN
1   2.0           b   0.0  9999.0    b
2   3.0           c   1.0  9999.0    c
3   4.0           d   1.0  9999.0    d
4   5.0           e   1.0  9999.0  NaN
5   6.0           f   1.0  9999.0  NaN
6  12.0         NaN   NaN     NaN  NaN

In [19]:
# 删除行号为6的行
df.drop(6,inplace=True,axis=0)  # inplace=True直接在原df上drop，默认生成一个新的dataframe
df

   one insert_col2  four    five  six
0  1.0           a   0.0  9999.0  NaN
1  2.0           b   0.0  9999.0    b
2  3.0           c   1.0  9999.0    c
3  4.0           d   1.0  9999.0    d
4  5.0           e   1.0  9999.0  NaN
5  6.0           f   1.0  9999.0  NaN

In [20]:
df.drop("insert_col2", axis=1)  #删除一列, inplace默认False，不在原df中删除，会返回一个删除了列的新df

   one  four    five  six
0  1.0   0.0  9999.0  NaN
1  2.0   0.0  9999.0    b
2  3.0   1.0  9999.0    c
3  4.0   1.0  9999.0    d
4  5.0   1.0  9999.0  NaN
5  6.0   1.0  9999.0  NaN

In [21]:
df

   one insert_col2  four    five  six
0  1.0           a   0.0  9999.0  NaN
1  2.0           b   0.0  9999.0    b
2  3.0           c   1.0  9999.0    c
3  4.0           d   1.0  9999.0    d
4  5.0           e   1.0  9999.0  NaN
5  6.0           f   1.0  9999.0  NaN

In [18]:
# 当为新的列赋值为Series对象时，
# 将会根据索引来进行匹配，没有匹配到索引的，将会填充为NaN
df['series'] = pd.Series(['b','c','d'],index = [1,2,3])
df

   one  two insert_col2  three  four series
0  1.0  2.0           a    3.0   0.0    NaN
1  2.0  3.0           b    5.0   0.0      b
2  3.0  4.0           c    7.0   1.0      c
3  4.0  5.0           d    9.0   1.0      d
4  5.0  6.0           e   11.0   1.0    NaN
5  6.0  7.0           f   13.0   1.0    NaN

In [96]:
# 向当前数据框的指定位置插入一列
df.insert(2,'insert_col',list('abcdef'))
df

   one insert_col2 insert_col   four  five  six series
0    1           a          a  False  9999  NaN    NaN
1    2           b          b  False  9999    b      b
2    3           c          c   True  9999    c      c
3    4           d          d   True  9999    d      d
4    5           e          e   True  9999  NaN    NaN
5    6           f          f   True  9999  NaN    NaN

### 3 数据导出
为了演示数据的导出。这里我们引入一个新的第三方库tushare，通过这个库，我们可以轻松的获取金融相关数据，如股票数据。以下为tushare库的介绍。
其官方文档地址为：http://tushare.org/index.html
TuShare是一个免费、开源的python财经数据接口包。主要实现对股票等金融数据从数据采集、清洗加工 到 数据存储的过程，能够为金融分析人员提供快速、整洁、和多样的便于分析的数据，为他们在数据获取方面极大地减轻工作量，使他们更加专注于策略和模型的研究与实现上。考虑到Python pandas包在金融量化分析中体现出的优势，TuShare返回的绝大部数据格式都是pandas DataFrame类型，非常便于用pandas/NumPy/Matplotlib进行数据分析和可视化。当然，如果您习惯了用Excel或者关系型数据库做分析，您也可以通过TuShare的数据存储功能，将数据全部保存到本地后进行分析。
我们先获取2017年，第二季度全部股票的业绩报告，盈利能力，营运能力数据，然后分别用不同方式保存它们。

In [97]:
# !pip install wheel
# !pip install lxml
# !pip install tushare
# !pip install beautifulsoup4
# !pip install requests
# !pip install pandas
# import tushare as ts
# # 业绩报告
# report = ts.get_report_data(2017,2)
# # 盈利能力
# profit = ts.get_profit_data(2017,2)
# # 营运能力
# operation = ts.get_operation_data(2017,2)

Looking in indexes: http://mirrors.aliyun.com/pypi/simple/
Requirement already satisfied: wheel in d:\soft\anaconda\lib\site-packages (0.34.2)
Looking in indexes: http://mirrors.aliyun.com/pypi/simple/
Requirement already satisfied: lxml in d:\soft\anaconda\lib\site-packages (4.5.0)
Looking in indexes: http://mirrors.aliyun.com/pypi/simple/
Collecting tushare
  Downloading http://mirrors.aliyun.com/pypi/packages/fc/96/d99c405aa2490205c08b3f75335014cde4b4bc4637d637c1dd8b64d6be64/tushare-1.2.60-py3-none-any.whl (214 kB)
Requirement already satisfied: lxml>=3.8.0 in d:\soft\anaconda\lib\site-packages (from tushare) (4.5.0)
Collecting bs4>=0.0.1
  Downloading http://mirrors.aliyun.com/pypi/packages/10/ed/7e8b97591f6f456174139ec089c769f89a94a1a4025fe967691de971f314/bs4-0.0.1.tar.gz (1.1 kB)
Collecting websocket-client>=0.57.0
  Downloading http://mirrors.aliyun.com/pypi/packages/4c/5f/f61b420143ed1c8dc69f9eaec5ff1ac36109d52c80de49d66e0c36c3dfdf/websocket_client-0.57.0-py2.py3-none-any.whl (200 kB)
Collecting simplejson>=3.16.0
  Downloading http://mirrors.aliyun.com/pypi/packages/ae/fd/36160c9ba8623b37e85ee40044046f965c050c29630536d55d83bc7a1c4e/simplejson-3.17.2-cp37-cp37m-win_amd64.whl (73 kB)
Requirement already satisfied: requests>=2.0.0 in d:\soft\anaconda\lib\site-packages (from tushare) (2.22.0)
Requirement already satisfied: beautifulsoup4 in d:\soft\anaconda\lib\site-packages (from bs4>=0.0.1->tushare) (4.8.2)
Requirement already satisfied: six in d:\soft\anaconda\lib\site-packages (from websocket-client>=0.57.0->tushare) (1.14.0)
Requirement already satisfied: idna<2.9,>=2.5 in d:\soft\anaconda\lib\site-packages (from requests>=2.0.0->tushare) (2.8)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in d:\soft\anaconda\lib\site-packages (from requests>=2.0.0->tushare) (3.0.4)
Requirement already satisfied: certifi>=2017.4.17 in d:\soft\anaconda\lib\site-packages (from requests>=2.0.0->tushare) (2019.11.28)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in d:\soft\anaconda\lib\site-packages (from requests>=2.0.0->tushare) (1.25.8)
Requirement already satisfied: soupsieve>=1.2 in d:\soft\anaconda\lib\site-packages (from beautifulsoup4->bs4>=0.0.1->tushare) (1.9.5)
Building wheels for collected packages: bs4
  Building wheel for bs4 (setup.py): started
  Building wheel for bs4 (setup.py): finished with status 'done'
  Created wheel for bs4: filename=bs4-0.0.1-py3-none-any.whl size=1279 sha256=bc66c6c1a099fe88604b708358e28654e1e8a38962ee054fe80c9b89ea05fa9e
  Stored in directory: c:\users\administrator\appdata\local\pip\cache\wheels\b7\55\d9\81ea9c1c33a1a533ffc844e56a060a6882d0c56f74570ab4ac
Successfully built bs4
Installing collected packages: bs4, websocket-client, simplejson, tushare
Successfully installed bs4-0.0.1 simplejson-3.17.2 tushare-1.2.60 websocket-client-0.57.0
Looking in indexes: http://mirrors.aliyun.com/pypi/simple/
Requirement already satisfied: beautifulsoup4 in d:\soft\anaconda\lib\site-packages (4.8.2)
Requirement already satisfied: soupsieve>=1.2 in d:\soft\anaconda\lib\site-packages (from beautifulsoup4) (1.9.5)
Looking in indexes: http://mirrors.aliyun.com/pypi/simple/
Requirement already satisfied: requests in d:\soft\anaconda\lib\site-packages (2.22.0)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in d:\soft\anaconda\lib\site-packages (from requests) (1.25.8)
Requirement already satisfied: idna<2.9,>=2.5 in d:\soft\anaconda\lib\site-packages (from requests) (2.8)
Requirement already satisfied: certifi>=2017.4.17 in d:\soft\anaconda\lib\site-packages (from requests) (2019.11.28)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in d:\soft\anaconda\lib\site-packages (from requests) (3.0.4)
Looking in indexes: http://mirrors.aliyun.com/pypi/simple/
Requirement already satisfied: pandas in d:\soft\anaconda\lib\site-packages (1.0.1)
Requirement already satisfied: numpy>=1.13.3 in d:\soft\anaconda\lib\site-packages (from pandas) (1.18.1)
Requirement already satisfied: python-dateutil>=2.6.1 in d:\soft\anaconda\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in d:\soft\anaconda\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: six>=1.5 in d:\soft\anaconda\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)
本接口即将停止更新，请尽快使用Pro版接口：https://tushare.pro/document/2
[Getting data:]##############################################################本接口即将停止更新，请尽快使用Pro版接口：https://tushare.pro/document/2
[Getting data:]##############################################################本接口即将停止更新，请尽快使用Pro版接口：https://tushare.pro/document/2
[Getting data:]##############################################################

In [22]:
report = pd.read_csv('report.csv')
report.head(3)

,code,name,eps,eps_yoy,bvps,roe,epcf,net_profits,profits_yoy,distrib,report_date
0,601956,东贝集团,0.10,NaN,NaN,3.51,NaN,3131.42,NaN,NaN,08-31
1,1211,双枪科技,0.35,NaN,NaN,4.70,NaN,1863.50,NaN,NaN,08-30
2,601156,东航物流,0.90,NaN,NaN,32.49,NaN,128153.42,NaN,NaN,08-28

In [23]:
profit = pd.read_csv('profit.csv')
profit.head(3)

,code,name,roe,net_profit_ratio,gross_profit_rate,net_profits,eps,business_income,bips
0,2164,宁波东力,198.33,215.23,30.7242,1120.6513,1.9844,520.6584,0.9219
1,2069,獐子岛,95.08,3.93,17.3403,39.9748,0.0562,1016.3683,1.4292
2,2188,*ST巴士,79.61,161.80,88.0692,2.4184,0.0082,1.4947,0.0051

In [24]:
operation = pd.read_csv('operation.csv')
operation.head(3)

,code,name,arturnover,arturndays,inventory_turnover,inventory_days,currentasset_turnover,currentasset_days
0,606,ST顺利,19.9614,9.0174,517032.0007,0.0003,3.2182,55.9319
1,2400,省广集团,2.2190,81.1176,57747.2750,0.0031,1.0807,166.5587
2,526,学大教育,34.7447,5.1806,20462.8677,0.0088,0.9678,185.9888

### 3.1 导出到本地文件
### 3.1.1 导出为文本文件

In [98]:
report.to_csv('./report.csv',index = False,encoding = 'utf-8')
profit.to_csv('./profit.csv',index = False,encoding = 'utf-8')
operation.to_csv('./operation.csv',index = False,encoding = 'utf-8')

### 3.1.2  导出为Excel文件

In [26]:
# 可以分别导出到不同的Excel工作簿；
# !pip  install openpyxl
report.to_excel('./report.xlsx',index =False)
profit.to_excel('./profit.xlsx',index = False)
operation.to_excel('./operation.xlsx',index =False)

In [25]:
#先打开一个Excel工作簿，然后分别写入三个表格，然后关掉Excel工作簿
writer = pd.ExcelWriter('./finance.xlsx')
report.to_excel(writer,sheet_name='report',index = False)
profit.to_excel(writer,sheet_name='profit',index = False)
operation.to_excel(writer,sheet_name='operation',index = False)
# 文件写入完毕后关掉Excel工作簿
writer.close()

### 3.1.3 导出为Json文件

In [26]:
# 导出为json文件
report.to_json('./report.json')

### 3.1.4 导出为hdf文件

In [103]:
# 导出为hdf文件
!pip install tables
from warnings import filterwarnings
filterwarnings('ignore')

report.to_hdf('./report.hdf','report')
# ImportError: HDFStore requires PyTables, "No module named 'tables'" problem importing

Looking in indexes: http://mirrors.aliyun.com/pypi/simple/
Requirement already satisfied: tables in d:\soft\anaconda\lib\site-packages (3.6.1)
Requirement already satisfied: numpy>=1.9.3 in d:\soft\anaconda\lib\site-packages (from tables) (1.18.1)
Requirement already satisfied: numexpr>=2.6.2 in d:\soft\anaconda\lib\site-packages (from tables) (2.7.1)

### 3.2 将数据存储到数据库

In [27]:
import sqlite3  # 一个轻量级 关系数据库 
# 创建连接
sqlite_con = sqlite3.connect('./pandas.db')
# 写入数据
report.to_sql('report',sqlite_con,if_exists ='replace',index =False)
profit.to_sql('profit',sqlite_con,if_exists ='replace',index =False)
operation.to_sql('operation',sqlite_con,if_exists ='replace',index =False)

In [36]:
report

,code,name,eps,eps_yoy,bvps,roe,epcf,net_profits,profits_yoy,distrib,report_date
0,601956,东贝集团,0.10,NaN,NaN,3.51,NaN,3131.42,NaN,NaN,08-31
1,1211,双枪科技,0.35,NaN,NaN,4.70,NaN,1863.50,NaN,NaN,08-30
2,601156,东航物流,0.90,NaN,NaN,32.49,NaN,128153.42,NaN,NaN,08-28
3,600032,浙江新能,0.09,-75.26,NaN,2.71,NaN,17252.72,-40.65,NaN,08-28
4,603529,爱玛科技,0.99,67.80,NaN,15.22,NaN,33512.81,67.38,NaN,08-28
...,...,...,...,...,...,...,...,...,...,...,...
4475,2107,沃华医药,0.23,155.56,NaN,12.78,NaN,9073.29,190.14,NaN,07-16
4476,2261,拓维信息,0.03,22.22,NaN,1.44,NaN,3606.78,23.46,NaN,07-15
4477,603880,南卫股份,0.38,171.43,NaN,13.85,NaN,8321.60,260.57,NaN,07-15
4478,300931,通用电梯,NaN,NaN,NaN,NaN,NaN,1682.58,20.07,NaN,07-14
4479,300861,美畅股份,NaN,NaN,NaN,NaN,NaN,21953.10,-0.92,NaN,07-09

### 3.3 数据导入
### 3.3.1 从本地文件

In [37]:
# 从文本文件
# 推荐使用相对路径
pd.read_csv('./report.csv').head(3)

,code,name,eps,eps_yoy,bvps,roe,epcf,net_profits,profits_yoy,distrib,report_date
0,601956,东贝集团,0.10,NaN,NaN,3.51,NaN,3131.42,NaN,NaN,08-31
1,1211,双枪科技,0.35,NaN,NaN,4.70,NaN,1863.50,NaN,NaN,08-30
2,601156,东航物流,0.90,NaN,NaN,32.49,NaN,128153.42,NaN,NaN,08-28

In [106]:
#从Excel文件
# 如果不是被迫选择Excel文件格式，一般不推荐使用Excel文件格式，速度很慢
#!pip install xlrd
pd.read_excel('./report.xlsx').head()

Looking in indexes: http://mirrors.aliyun.com/pypi/simple/
Requirement already satisfied: xlrd in d:\soft\anaconda\lib\site-packages (1.2.0)

,code,name,eps,eps_yoy,bvps,roe,epcf,net_profits,profits_yoy,distrib,report_date
0,2906,华阳集团,0.34,NaN,NaN,5.62,NaN,13580.23,NaN,NaN,08-30
1,300691,联合光电,0.50,NaN,NaN,12.30,NaN,5095.21,NaN,NaN,08-28
2,601869,长飞光纤,0.82,NaN,NaN,13.00,NaN,56052.41,NaN,NaN,08-27
3,603192,汇得科技,0.66,NaN,NaN,11.10,0.57,5261.60,NaN,NaN,08-27
4,603733,仙鹤股份,0.33,NaN,NaN,8.83,NaN,18347.21,NaN,NaN,08-25

In [107]:
# 如果一个Excel工作簿有多个表格，那么需要指定传入的表格名称
pd.read_excel('./finance.xlsx',sheet_name='report').head()

,code,name,eps,eps_yoy,bvps,roe,epcf,net_profits,profits_yoy,distrib,report_date
0,2906,华阳集团,0.34,NaN,NaN,5.62,NaN,13580.23,NaN,NaN,08-30
1,300691,联合光电,0.50,NaN,NaN,12.30,NaN,5095.21,NaN,NaN,08-28
2,601869,长飞光纤,0.82,NaN,NaN,13.00,NaN,56052.41,NaN,NaN,08-27
3,603192,汇得科技,0.66,NaN,NaN,11.10,0.57,5261.60,NaN,NaN,08-27
4,603733,仙鹤股份,0.33,NaN,NaN,8.83,NaN,18347.21,NaN,NaN,08-25

In [108]:
pd.read_json('./report.json').head()

,code,name,eps,eps_yoy,bvps,roe,epcf,net_profits,profits_yoy,distrib,report_date
0,2906,华阳集团,0.34,NaN,NaN,5.62,NaN,13580.23,NaN,None,08-30
1,300691,联合光电,0.50,NaN,NaN,12.30,NaN,5095.21,NaN,None,08-28
2,601869,长飞光纤,0.82,NaN,NaN,13.00,NaN,56052.41,NaN,None,08-27
3,603192,汇得科技,0.66,NaN,NaN,11.10,0.57,5261.60,NaN,None,08-27
4,603733,仙鹤股份,0.33,NaN,NaN,8.83,NaN,18347.21,NaN,None,08-25

In [109]:
pd.read_hdf('./report.hdf','report').head()

,code,name,eps,eps_yoy,bvps,roe,epcf,net_profits,profits_yoy,distrib,report_date
0,002906,华阳集团,0.34,NaN,NaN,5.62,NaN,13580.23,NaN,NaN,08-30
1,300691,联合光电,0.50,NaN,NaN,12.30,NaN,5095.21,NaN,NaN,08-28
2,601869,长飞光纤,0.82,NaN,NaN,13.00,NaN,56052.41,NaN,NaN,08-27
3,603192,汇得科技,0.66,NaN,NaN,11.10,0.57,5261.60,NaN,NaN,08-27
4,603733,仙鹤股份,0.33,NaN,NaN,8.83,NaN,18347.21,NaN,NaN,08-25

### 3.3.2 从数据库

In [38]:
import sqlite3
import pandas as pd
# 创建连接
sqlite_con = sqlite3.connect('./pandas.db')
# 读取数据，显示前5行
pd.read_sql('select * from report limit 5',sqlite_con)

,code,name,eps,eps_yoy,bvps,roe,epcf,net_profits,profits_yoy,distrib,report_date
0,601956,东贝集团,0.10,NaN,None,3.51,None,3131.42,NaN,None,08-31
1,1211,双枪科技,0.35,NaN,None,4.70,None,1863.50,NaN,None,08-30
2,601156,东航物流,0.90,NaN,None,32.49,None,128153.42,NaN,None,08-28
3,600032,浙江新能,0.09,-75.26,None,2.71,None,17252.72,-40.65,None,08-28
4,603529,爱玛科技,0.99,67.80,None,15.22,None,33512.81,67.38,None,08-28

In [40]:
pd.read_sql('select report_date,sum(net_profits) as total_profits from report group by report_date',sqlite_con)

    report_date  total_profits
0         01-04        5193.06
1         01-06        1002.30
2         01-07        9200.30
3         01-11        5415.15
4         01-12        7485.71
..          ...            ...
137       12-17         924.70
138       12-22       10813.32
139       12-23      -21987.61
140       12-29       44874.55
141       12-31        5470.84

[142 rows x 2 columns]

### 4 分组计算与汇总
### 4.1 导入数据

In [41]:
# !wget wget http://59.110.26.116:8888/sgn/HUP/Visual/2/super_store.xls
order = pd.read_excel('./super_store.xls',sheet_name = '订单')
order.head(2)

,行 ID,订单 ID,订单日期,发货日期,邮寄方式,客户 ID,客户名称,细分,城市,省/自治区,国家,地区,产品 ID,类别,子类别,产品名称,销售额,数量,折扣,利润
0,1,US-2018-1357144,2018-04-27,2018-04-29,二级,曾惠-14485,曾惠,公司,杭州,浙江,中国,华东,办公用-用品-10002717,办公用品,用品,"Fiskars 剪刀, 蓝色",129.696,2,0.4,-60.704
1,2,CN-2018-1973789,2018-06-15,2018-06-19,标准级,许安-10165,许安,消费者,内江,四川,中国,西南,办公用-信封-10004832,办公用品,信封,"GlobeWeis 搭扣信封, 红色",125.440,2,0.0,42.560

In [46]:
order.columns.size

20

In [45]:
order.count()[0]

9959

In [48]:
order["类别"].unique()

array(['办公用品', '技术', '家具'], dtype=object)

In [50]:
order.销售额

0        129.696
1        125.440
2         31.920
3        321.216
4       1375.920
          ...
9954     944.244
9955     447.720
9956     239.988
9957    4851.588
9958    7244.580
Name: 销售额, Length: 9959, dtype: float64

In [51]:
order.销售额.describe()

count     9959.000000
mean      1613.510807
std       2641.237786
min         13.440000
25%        250.460000
50%        636.300000
75%       1785.210000
max      35621.355000
Name: 销售额, dtype: float64

In [40]:
order.describe()

               行 ID           销售额           数量           折扣            利润
count   9959.000000   9959.000000  9959.000000  9959.000000   9959.000000
mean    5002.143187   1613.510807     3.768852     0.106406    215.638008
std     2886.562485   2641.237786     2.236739     0.187477    858.710532
min        1.000000     13.440000     1.000000     0.000000  -7978.320000
25%     2508.500000    250.460000     2.000000     0.000000      7.756000
50%     5003.000000    636.300000     3.000000     0.000000     74.200000
75%     7503.500000   1785.210000     5.000000     0.200000    277.200000
max    10000.000000  35621.355000    14.000000     0.800000  10108.280000

### 4.2 按照地区对所有的数值型变量进行汇总

In [52]:
order.groupby(['地区']).sum()

        行 ID          销售额     数量      折扣          利润
地区
东北   8296805  2681567.469   6463  234.75  242191.509
中南  13157091  4137415.093   9700  232.15  670885.313
华东  14550225  4684506.442  11041  331.10  607218.682
华北   6939587  2447301.017   5146   74.10  431053.217
西北   2368978   815039.596   1785   53.40   98553.476
西南   4503658  1303124.508   3399  134.20   97636.728

In [56]:
list(order.groupby(['地区']))[0]  #(分组字段值，当前分组的dataframe)
list(order.groupby(['地区']))[0][1]

,行 ID,订单 ID,订单日期,发货日期,邮寄方式,客户 ID,客户名称,细分,城市,省/自治区,国家,地区,产品 ID,类别,子类别,产品名称,销售额,数量,折扣,利润
11,12,CN-2018-5801711,2018-06-01,2018-06-06,标准级,康青-19585,康青,消费者,哈尔滨,黑龙江,中国,东北,技术-复印-10002416,技术,复印机,"惠普 墨水, 红色",2368.80,4,0.00,639.52
42,43,CN-2017-4054371,2017-12-24,2017-12-26,二级,吕兰-15700,吕兰,消费者,肇源,黑龙江,中国,东北,办公用-器具-10003452,办公用品,器具,"KitchenAid 搅拌机, 黑色",4127.76,9,0.00,1650.60
49,50,CN-2018-2396895,2018-06-19,2018-06-22,二级,薛磊-15985,薛磊,消费者,蛟河,吉林,中国,东北,技术-电话-10004015,技术,电话,"思科 充电器, 全尺寸",12183.36,4,0.00,1340.08
50,51,CN-2018-2396895,2018-06-19,2018-06-22,二级,薛磊-15985,薛磊,消费者,蛟河,吉林,中国,东北,技术-复印-10003216,技术,复印机,"Hewlett 传真机, 彩色",2999.36,2,0.00,1229.48
51,52,CN-2018-2396895,2018-06-19,2018-06-22,二级,薛磊-15985,薛磊,消费者,蛟河,吉林,中国,东北,办公用-收纳-10000501,办公用品,收纳具,"Tenex 盘, 工业",510.44,2,0.00,224.56
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9944,9986,CN-2016-1608087,2016-08-13,2016-08-14,一级,贺斯-20935,贺斯云,消费者,哈尔滨,黑龙江,中国,东北,办公用-装订-10000850,办公用品,装订机,"Wilson Jones 装订机盖, 回收",107.80,2,0.00,19.32
9945,9987,CN-2016-1608087,2016-08-13,2016-08-14,一级,贺斯-20935,贺斯云,消费者,哈尔滨,黑龙江,中国,东北,办公用-用品-10002884,办公用品,用品,"Stiletto 修剪器, 蓝色",399.00,2,0.00,51.80
9946,9988,CN-2016-1608087,2016-08-13,2016-08-14,一级,贺斯-20935,贺斯云,消费者,哈尔滨,黑龙江,中国,东北,办公用-纸张-10004825,办公用品,纸张,"施乐 令, 回收",367.50,3,0.00,32.76
9952,9994,US-2015-5128542,2015-05-23,2015-05-27,标准级,贺婉-21355,贺婉,公司,四平,吉林,中国,东北,技术-配件-10002428,技术,配件,"罗技 闪存驱动器, 回收",396.48,3,0.00,23.52
9953,9995,CN-2018-5146329,2018-09-17,2018-09-20,一级,武明-18385,武明媚,消费者,讷河,黑龙江,中国,东北,家具-桌子-10002211,家具,桌子,"Barricks 电脑桌, 白色",3360.21,2,0.25,-268.87

In [57]:
order.groupby(['地区'])["行 ID"].count()

地区
东北    1666
中南    2581
华东    2944
华北    1369
西北     478
西南     921
Name: 行 ID, dtype: int64

### 4.3 选择有现实意义的数值型变量进行汇总

In [58]:
# 按照地区对销售额,销售数量,销售利润进行汇总
order.groupby(['地区'])['销售额','数量','利润'].sum()

<ipython-input-58-1d5f6849d054>:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  order.groupby(['地区'])['销售额','数量','利润'].sum()

            销售额     数量          利润
地区
东北  2681567.469   6463  242191.509
中南  4137415.093   9700  670885.313
华东  4684506.442  11041  607218.682
华北  2447301.017   5146  431053.217
西北   815039.596   1785   98553.476
西南  1303124.508   3399   97636.728

In [66]:
# 不同细分市场的销售额
order.groupby('细分').销售额.sum()
order.groupby('细分').sum().销售额
order.groupby('细分').sum()['销售额']
order.groupby('细分')['销售额'].sum().sort_values(ascending=False).head(1)

细分
消费者    8025072.188
Name: 销售额, dtype: float64

In [ ]:
order.groupby('细分').sum().销售额

In [ ]:
order.groupby('细分')['销售额'].sum()

In [ ]:
# 按照地区对销售额,销售利润来求平均值
order.groupby(['地区'])['销售额','利润'].mean()

### 4.4 分组查看变量的描述性统计量

In [68]:
# 根据不同地区查看销售额的描述性统计
order.groupby(['地区'])['销售额'].describe()
order.groupby(['地区']).describe()['销售额']

,count,mean,std,min,25%,50%,75%,max
地区,,,,,,,,
东北,1666.0,1609.584315,2555.175164,13.692,261.345,648.480,1797.705,25711.840
中南,2581.0,1603.027932,2555.205920,13.440,248.640,627.228,1732.584,25995.060
华东,2944.0,1591.204634,2658.711765,13.580,244.825,631.890,1759.975,29124.480
华北,1369.0,1787.655966,3002.880726,15.876,263.760,669.480,1989.400,35621.355
西北,478.0,1705.103757,2751.197403,20.580,256.515,649.950,1855.938,20942.880
西南,921.0,1414.901746,2312.450611,23.520,235.200,584.500,1610.448,24536.400

In [ ]:
order.groupby(['地区'])['销售额'].describe()

In [ ]:
# 分组查看利润的描述性统计
order.groupby('地区')['利润'].describe()

### 4.5 按照多个分类变量对数据进行汇总

In [69]:
# 按照市场细分和地区来汇总销售额
order.groupby(['细分','地区']).sum()['销售额']

                 销售额
细分   地区
公司   东北   834842.827
     中南  1335665.324
     华东  1454715.808
     华北   804769.469
     西北   253458.184
     西南   469341.684
小型企业 东北   522739.035
     中南   743813.007
     华东   942432.372
     华北   422100.987
     西北   103523.308
     西南   156479.932
消费者  东北  1323985.607
     中南  2057936.762
     华东  2287358.262
     华北  1220430.561
     西北   458058.104
     西南   677302.892

In [58]:
# 按照市场细分和地区来汇总销售额,利润,和销售数量
order.groupby(['细分','地区']).sum()[['销售额','利润','数量']]

                 销售额          利润    数量
细分   地区
公司   东北   834842.827   56978.327  1987
     中南  1335665.324  197862.084  3098
     华东  1454715.808  186383.428  3344
     华北   804769.469  166445.209  1485
     西北   253458.184   44090.564   548
     西南   469341.684   30208.024  1119
小型企业 东北   522739.035   64188.915  1230
     中南   743813.007  147234.507  1733
     华东   942432.372  109774.252  2131
     华北   422100.987   72593.227   987
     西北   103523.308    5439.728   223
     西南   156479.932   13248.032   476
消费者  东北  1323985.607  121024.267  3246
     中南  2057936.762  325788.722  4869
     华东  2287358.262  311061.002  5566
     华北  1220430.561  192014.781  2674
     西北   458058.104   49023.184  1014
     西南   677302.892   54180.672  1804

### 4.6 将透视分析结果以交叉表的形式呈现

In [70]:
# 默认呈现方式
order.groupby(['细分','类别'])['销售额','利润'].sum()

<ipython-input-70-ca46da077aa6>:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  order.groupby(['细分','类别'])['销售额','利润'].sum()

                   销售额          利润
细分   类别
公司   办公用品  1484595.924  226830.604
     家具    1903622.756  230733.636
     技术    1764574.616  224403.396
小型企业 办公用品   837464.544  148528.604
     家具    1042003.641  123404.281
     技术    1011620.456  140545.776
消费者  办公用品  2543529.324  382281.144
     家具    2788714.432  284597.712
     技术    2692828.432  386213.772

In [62]:
order.groupby(['类别','细分'])['销售额','利润'].sum()

<ipython-input-62-27c961e69d08>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  order.groupby(['类别','细分'])['销售额','利润'].sum()

                   销售额          利润
类别   细分
办公用品 公司    1484595.924  226830.604
     小型企业   837464.544  148528.604
     消费者   2543529.324  382281.144
家具   公司    1903622.756  230733.636
     小型企业  1042003.641  123404.281
     消费者   2788714.432  284597.712
技术   公司    1764574.616  224403.396
     小型企业  1011620.456  140545.776
     消费者   2692828.432  386213.772

In [71]:
# 以交叉表的形式呈现
order.groupby(['细分','类别'])['销售额','利润'].sum().unstack()

<ipython-input-71-6b37fba274c5>:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  order.groupby(['细分','类别'])['销售额','利润'].sum().unstack()

              销售额                                    利润              \
类别           办公用品           家具           技术        办公用品          家具
细分
公司    1484595.924  1903622.756  1764574.616  226830.604  230733.636
小型企业   837464.544  1042003.641  1011620.456  148528.604  123404.281
消费者   2543529.324  2788714.432  2692828.432  382281.144  284597.712


类别            技术
细分
公司    224403.396
小型企业  140545.776
消费者   386213.772

### 5 数据融合
### 5.1 构造数据

In [ ]:
raw_data01 = {'col_a':[1,2,3,4],
              'col_b':list('abcd'),
              'col_c':[True]*2+[False]*2}

raw_data02 = {'ID':[1,3,4,5],
              'col_b':['a','d','c','e']}

df1 = pd.DataFrame(raw_data01)
df2 = pd.DataFrame(raw_data02)

In [ ]:
df1

In [ ]:
df2

### 5.2 直接进行连接

In [ ]:
# 连接方式1
pd.merge(df1,df2)

In [ ]:
# 连接方式2
df1.merge(df2)

### 5.3 指定字段进行连接

In [ ]:
# 根据能够进行匹配的一个字段进行连接
pd.merge(df1,df2,left_on=['col_a'],right_on=['ID'])

In [ ]:
# 根据能够进行匹配的多个字段进行连接
pd.merge(df1,df2,left_on=['col_a','col_b'],right_on=['ID','col_b'])

### 5.4 指定根据哪个表进行连接

In [ ]:
# 左连接
pd.merge(df1,df2,how = 'left')

In [ ]:
# 换一种写法
df1.merge(df2,how = 'right')

In [ ]:
# 右连接
pd.merge(df1,df2,how = 'right')

In [ ]:
# 内连接
pd.merge(df1,df2,how ='inner')

In [ ]:
# 外连接
pd.merge(df1,df2,how = 'outer')

### 6 案例：分析每个地区经理负责的区域退货订单数量
### 6.1 导入需要进行融合的数据集

In [ ]:
order = pd.read_excel('./super_store.xls',sheet_name='订单')
returns = pd.read_excel('./super_store.xls',sheet_name='退货')
salers = pd.read_excel('./super_store.xls',sheet_name='销售人员')

### 6.2 分别查看这几个数据集的格式

In [ ]:
order.head(2)

In [ ]:
returns.head()

In [ ]:
salers.head()

### 6.3 统计订单数量与销售的商品数量

In [ ]:
# 商品数量
len(order)

In [ ]:
# 订单数量（一个订单对应多个商品）
len(order['订单 ID'].unique())

In [ ]:
# 查看是否有一个订单送往多个地区的情形
len(order[['地区','订单 ID']].drop_duplicates())

### 6.4 按照地区对订单ID进行去重

In [ ]:
# 去重后的结果保存在distinct_order中
distinct_order = order[['地区','订单 ID']].drop_duplicates()
distinct_order.count()

In [ ]:
distinct_order.head(2)

### 6.5 将退货记录表和独立订单ID表进行融合,这样就将退货的订单ID与地区进行了关联

In [ ]:
# 融合后的结果保存在return_ID中
returns_ID = pd.merge(returns,distinct_order,how = 'left',on = ['订单 ID'])

In [ ]:
returns_ID.head(2)

### 6.6 将地区与销售经理进行关联,这样就能够知道每一个具体的退货订单对应的销售经理

In [ ]:
pd.merge(returns_ID,salers,how ='left',on ='地区').head()

In [ ]:
# 不同销售经理笔下的退货订单数量
pd.merge(returns_ID,salers,how ='left',on ='地区').groupby('地区经理')['订单 ID'].count()

### 6.7 也可以直接先将3个表进行连接,之后再统计独立订单数量

In [ ]:
# 连接order表和returns表
# 再连接sales表
# 提取两个字段 ['地区经理','订单 ID'],并去除重复记录
# 分组汇总

order.merge(returns,how='right',on='订单 ID')\
     .merge(salers,how='left',on='地区')\
     [['地区经理','订单 ID']].drop_duplicates()\
     .groupby('地区经理').count()